In [1]:
def big(x):
    return x.upper()

df.sex = df.sex.apply(lambda x : big(x))

df[['sex']]

NameError: name 'df' is not defined

In [ ]:
import time 

s = time.time()

str

In [2]:
import time 

#time -> str 

t = time.time()
s = str(t)

print(t, type(t), '\n')
print(s, type(s))

1657216837.6913955 <class 'float'>

1657216837.6913955 <class 'str'>

In [4]:
#datetime -> str 

from datetime import datetime
d = datetime.now()
s = d.strftime('%Y-%m-%d %H:%M:%S')
print(d, '\n')
print(s, type(s))

2022-07-08 03:02:19.426194

2022-07-08 03:02:19 <class 'str'>

In [5]:
#str -> datetime

da = datetime.strptime(s, '%Y-%m-%d %H:%M:%S')
print(da, type(da))

2022-07-08 03:02:19 <class 'datetime.datetime'>

In [6]:
#str -> datetime -> timestamp

ts = time.mktime(da.timetuple())
print(ts, type(ts))

1657216939.0 <class 'float'>

In [7]:
#timestamp -> datetime

dt = datetime.fromtimestamp(ts)
print(dt, type(dt))

2022-07-08 03:02:19 <class 'datetime.datetime'>

In [ ]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

df['RM'] = scaler.fit_transform(df[['RM']])
df[['RM']].describe()

In [ ]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

df['INDUS'] = scaler.fit_transform(df[['INDUS']])
df[['INDUS']].describe()

In [8]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.copy()

In [9]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [10]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

features = ['embarked', 'who', 'adult_male']
d
for f in features:
    df[f] = le.fit_transform(df[f])

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,2,Third,1,1,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,0,First,2,0,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,2,Third,2,0,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,2,First,2,0,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,2,Third,1,1,NaN,Southampton,no,True

In [13]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd
df1 = titanic.copy()

df2 = df1[['embarked', 'who', 'adult_male']]

pd.get_dummies(df2)

,adult_male,embarked_C,embarked_Q,embarked_S,who_child,who_man,who_woman
0,True,0,0,1,0,1,0
1,False,1,0,0,0,0,1
2,False,0,0,1,0,0,1
3,False,0,0,1,0,0,1
4,True,0,0,1,0,1,0
...,...,...,...,...,...,...,...
886,True,0,0,1,0,1,0
887,False,0,0,1,0,0,1
888,False,0,0,1,0,0,1
889,True,1,0,0,0,1,0
890,True,0,1,0,0,1,0